soap-sample-requests/createMission.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:createMissionRequest>
        <gs:professorId>12</gs:professorId>
        <gs:title>Some mission title</gs:title>
        <gs:description>Some description</gs:description>
      </gs:createMissionRequest>
   </soapenv:Body>
</soapenv:Envelope>